# Introduction into Pandas

In [30]:
import pandas as pd
import numpy as np

In [10]:
s = pd.Series([1,2,3,4,5])
print(s, s.index, s.values)

0    1
1    2
2    3
3    4
4    5
dtype: int64 RangeIndex(start=0, stop=5, step=1) [1 2 3 4 5]

In [19]:
fruits = ['apples', 'oranges', 'cherries', 'pears']
fruits2 = ['raspberries', 'oranges', 'cherries', 'pears']

quantities = [20,33,52,10]
s = pd.Series(quantities, index=fruits)
s2 = pd.Series([10,10,10,10], index=fruits)
s3 = pd.Series([1,1,1,1], index=fruits2)
s + s2 + s3

apples          NaN
cherries       63.0
oranges        44.0
pears          21.0
raspberries     NaN
dtype: float64

In [27]:
s = pd.Series([20,33,52,10], index=['apples', 'oranges', 'cherries', 'pears'] )
print(s['apples'])
print(s[['apples', 'pears']])

20
apples    20
pears     10
dtype: int64

In [36]:
print( s.apply(np.log), "\n" )
print( s.apply( lambda x: x if x>50 else x+10 ) )

apples      2.995732
oranges     3.496508
cherries    3.951244
pears       2.302585
dtype: float64

apples      30
oranges     43
cherries    52
pears       20
dtype: int64

In [42]:
print( s[s>30], "\n" )
print( "apples" in s )

oranges     33
cherries    52
dtype: int64

True

In [44]:
cities = {"London":    8615246, 
          "Berlin":    3562166, 
          "Madrid":    3165235, 
          "Rome":      2874038, 
          "Paris":     2273305, 
          "Vienna":    1805681, 
          "Bucharest": 1803425, 
          "Hamburg":   1760433,
          "Budapest":  1754000,
          "Warsaw":    1740119,
          "Barcelona": 1602386,
          "Munich":    1493900,
          "Milan":     1350680}

city_series = pd.Series(cities)
city_series

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
dtype: int64

In [59]:
my_cities = ["London", "Paris", "Zurich", "Berlin", "Stuttgart", "Hamburg"]
my_cities_series = pd.Series(cities, index=my_cities)
print( my_cities_series, "\n" )
print(my_cities_series.isnull(), "\n")
print(my_cities_series.notnull())

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64

London       False
Paris        False
Zurich        True
Berlin       False
Stuttgart     True
Hamburg      False
dtype: bool

London        True
Paris         True
Zurich       False
Berlin        True
Stuttgart    False
Hamburg       True
dtype: bool

In [61]:
d = {"a":23, "b":45, "c":None, "d":0}
s = pd.Series(d)
s

a    23.0
b    45.0
c     NaN
d     0.0
dtype: float64

In [64]:
print( my_cities_series.dropna() )

London     8615246.0
Paris      2273305.0
Berlin     3562166.0
Hamburg    1760433.0
dtype: float64

In [66]:
print( my_cities_series.fillna(0) )

London       8615246.0
Paris        2273305.0
Zurich             0.0
Berlin       3562166.0
Stuttgart          0.0
Hamburg      1760433.0
dtype: float64

In [69]:
missing_cities = {"Stuttgart":597939, "Zurich":378884}
my_cities_series.fillna(missing_cities)

London       8615246.0
Paris        2273305.0
Zurich        378884.0
Berlin       3562166.0
Stuttgart     597939.0
Hamburg      1760433.0
dtype: float64

In [77]:
cities = {"London":   8615246, 
          "Berlin":   3562166, 
          "Madrid":   3165235, 
          "Rome":     2874038, 
          "Paris":    2273305, 
          "Vienna":   1805681, 
          "Bucharest":1803425, 
          "Hamburg":  1760433,
          "Budapest": 1754000,
          "Warsaw":   1740119,
          "Barcelona":1602386,
          "Munich":   1493900,
          "Milan":    1350680}

my_cities = ["London", "Paris", "Zurich", "Berlin", "Stuttgart", "Hamburg"]
my_cities_series = pd.Series(cities, index=my_cities)
my_cities_series = my_cities_series.fillna(0).astype(int)
my_cities_series

London       8615246
Paris        2273305
Zurich             0
Berlin       3562166
Stuttgart          0
Hamburg      1760433
dtype: int64

# Pandas DataFrame

In [93]:
years = range(2014, 2018)

shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years)
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years)
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)

shops_df = pd.concat([shop1, shop2, shop3], axis=1)
shops_df

            0        1        2
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10

In [103]:
cities = ["Zurich", "Winterthur", "Freiburg"]
shops_df.columns = cities

"""
Alternative way
shop1.name = "Zürich"
shop2.name = "Winterthur"
shop3.name = "Freiburg"
"""
print(shop1)
shop1.name = "Zurich"
print(shop1)
shops_df2 = pd.concat([shop1, shop2, shop3], axis=1)
shops_df2

2014    2409.14
2015    2941.01
2016    3496.83
2017    3119.55
Name: Zurich, dtype: float64
2014    2409.14
2015    2941.01
2016    3496.83
2017    3119.55
Name: Zurich, dtype: float64

       Zurich        0        1
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10

In [106]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris", "Vienna", "Bucharest", "Hamburg", 
                   "Budapest", "Warsaw", "Barcelona", 
                   "Munich", "Milan"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433,
                         1754000, 1740119, 1602386, 1493900,
                         1350680],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania", 
                      "Germany", "Hungary", "Poland", "Spain",
                      "Germany", "Italy"]}

city_frame = pd.DataFrame(cities)
city_frame

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

In [122]:
city_frame.columns

Index(['name', 'population', 'country'], dtype='object')

In [124]:
ordinals = ["first", "second", "third", "fourth",
            "fifth", "sixth", "seventh", "eigth",
            "ninth", "tenth", "eleventh", "twelvth",
            "thirteenth"]
city_frame = pd.DataFrame(cities, index=ordinals)
city_frame

                 name  population  country
first          London     8615246  England
second         Berlin     3562166  Germany
third          Madrid     3165235    Spain
fourth           Rome     2874038    Italy
fifth           Paris     2273305   France
sixth          Vienna     1805681  Austria
seventh     Bucharest     1803425  Romania
eigth         Hamburg     1760433  Germany
ninth        Budapest     1754000  Hungary
tenth          Warsaw     1740119   Poland
eleventh    Barcelona     1602386    Spain
twelvth        Munich     1493900  Germany
thirteenth      Milan     1350680    Italy

In [127]:
city_frame = pd.DataFrame(cities, columns=["name", "country", "population"])
city_frame

         name  country  population
0      London  England     8615246
1      Berlin  Germany     3562166
2      Madrid    Spain     3165235
3        Rome    Italy     2874038
4       Paris   France     2273305
5      Vienna  Austria     1805681
6   Bucharest  Romania     1803425
7     Hamburg  Germany     1760433
8    Budapest  Hungary     1754000
9      Warsaw   Poland     1740119
10  Barcelona    Spain     1602386
11     Munich  Germany     1493900
12      Milan    Italy     1350680

In [131]:
city_frame.reindex(index=[0,2,4,6,8,10,12,1,3,5,7,9,11], columns=["country","name","population"])

    country       name  population
0   England     London     8615246
2     Spain     Madrid     3165235
4    France      Paris     2273305
6   Romania  Bucharest     1803425
8   Hungary   Budapest     1754000
10    Spain  Barcelona     1602386
12    Italy      Milan     1350680
1   Germany     Berlin     3562166
3     Italy       Rome     2874038
5   Austria     Vienna     1805681
7   Germany    Hamburg     1760433
9    Poland     Warsaw     1740119
11  Germany     Munich     1493900

In [138]:
city_frame.rename(columns={"name":"Soyadi","country":"Ulke","population":"Nufus"}, inplace=True)
city_frame

       Soyadi     Ulke    Nufus
0      London  England  8615246
1      Berlin  Germany  3562166
2      Madrid    Spain  3165235
3        Rome    Italy  2874038
4       Paris   France  2273305
5      Vienna  Austria  1805681
6   Bucharest  Romania  1803425
7     Hamburg  Germany  1760433
8    Budapest  Hungary  1754000
9      Warsaw   Poland  1740119
10  Barcelona    Spain  1602386
11     Munich  Germany  1493900
12      Milan    Italy  1350680

In [144]:
city_frame = pd.DataFrame(cities, columns=["name","population"], index=cities["country"])
city_frame

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [145]:
city_frame2 = pd.DataFrame(cities).set_index("country")
city_frame2

              name  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [151]:
city_frame = pd.DataFrame(cities, columns=("name","population"), index=cities["country"])
city_frame.loc["Germany"]

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900

In [154]:
city_frame.loc[["Germany", "France"]]

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900
France     Paris     2273305

In [159]:
city_frame[ city_frame.population > 2000000 ]

           name  population
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

In [167]:
city_frame.loc[(city_frame.population>1500000) & (city_frame['name'].str.contains("m"))]

            name  population
Italy       Rome     2874038
Germany  Hamburg     1760433

In [170]:
city_frame.loc[(city_frame.population>3000000) | (city_frame["name"].str.contains("m"))]

            name  population
England   London     8615246
Germany   Berlin     3562166
Spain     Madrid     3165235
Italy       Rome     2874038
Germany  Hamburg     1760433

In [177]:
milan = ["Milan", 1399860]
city_frame.iloc[-1] = milan
city_frame.loc["Switzerland"] = ["Zurich", 415215]
city_frame

                  name  population
England         London     8615246
Germany         Berlin     3562166
Spain           Madrid     3165235
Italy             Rome     2874038
France           Paris     2273305
Austria         Vienna     1805681
Romania      Bucharest     1803425
Germany        Hamburg     1760433
Hungary       Budapest     1754000
Poland          Warsaw     1740119
Spain        Barcelona     1602386
Germany         Munich     1493900
Italy            Milan     1399860
Switzerland     Zurich      415215

In [179]:
city_frame.iloc[[3,2,0,5,0]]

           name  population
Italy      Rome     2874038
Spain    Madrid     3165235
England  London     8615246
Austria  Vienna     1805681
England  London     8615246

In [198]:
years = range(2014,2019)
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücken"]
shops = pd.DataFrame(index=years)

for city in cities:
    shops.insert(loc=len(shops.columns), column=city, value=(np.random.uniform(0.7, 1, (5)) * 1000).round(2))
print( shops.sum(), "\n" )
print( shops.sum(axis=1) )
shops

Zürich         3830.19
Freiburg       4338.41
München        4139.58
Konstanz       4237.34
Saarbrücken    4034.53
dtype: float64

2014    4223.66
2015    4271.81
2016    3994.51
2017    3793.95
2018    4296.12
dtype: float64

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  715.13    895.66   835.43    938.71       838.73
2015  778.10    954.15   879.09    800.42       860.05
2016  705.53    823.31   742.09    905.43       818.15
2017  737.83    827.54   721.73    727.48       779.37
2018  893.60    837.75   961.24    865.30       738.23

In [201]:
s = shops.iloc[:, [0,2,3]]
print( s.sum() )
s

Zürich      3830.19
München     4139.58
Konstanz    4237.34
dtype: float64

      Zürich  München  Konstanz
2014  715.13   835.43    938.71
2015  778.10   879.09    800.42
2016  705.53   742.09    905.43
2017  737.83   721.73    727.48
2018  893.60   961.24    865.30

In [203]:
s.cumsum()

       Zürich  München  Konstanz
2014   715.13   835.43    938.71
2015  1493.23  1714.52   1739.13
2016  2198.76  2456.61   2644.56
2017  2936.59  3178.34   3372.04
2018  3830.19  4139.58   4237.34

In [207]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris", "Vienna", "Bucharest", "Hamburg", 
                   "Budapest", "Warsaw", "Barcelona", 
                   "Munich", "Milan"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433,
                         1754000, 1740119, 1602386, 1493900,
                         1350680],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania", 
                      "Germany", "Hungary", "Poland", "Spain",
                      "Germany", "Italy"]}

city_frame = pd.DataFrame(cities, columns=["country", "population", "cum_population"], index=cities["name"])
city_frame["cum_population"] = city_frame["population"].cumsum()
city_frame

           country  population  cum_population
London     England     8615246         8615246
Berlin     Germany     3562166        12177412
Madrid       Spain     3165235        15342647
Rome         Italy     2874038        18216685
Paris       France     2273305        20489990
Vienna     Austria     1805681        22295671
Bucharest  Romania     1803425        24099096
Hamburg    Germany     1760433        25859529
Budapest   Hungary     1754000        27613529
Warsaw      Poland     1740119        29353648
Barcelona    Spain     1602386        30956034
Munich     Germany     1493900        32449934
Milan        Italy     1350680        33800614

In [212]:
print(city_frame["population"], "\n")
print(city_frame.population, "\n")

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [215]:
area = [1572, 891.85, 605.77, 1285, 
        105.4, 414.6, 228, 755, 
        525.2, 517, 101.9, 310.4, 
        181.8]

city_frame["area"] = area
city_frame

           country  population  cum_population     area
London     England     8615246         8615246  1572.00
Berlin     Germany     3562166        12177412   891.85
Madrid       Spain     3165235        15342647   605.77
Rome         Italy     2874038        18216685  1285.00
Paris       France     2273305        20489990   105.40
Vienna     Austria     1805681        22295671   414.60
Bucharest  Romania     1803425        24099096   228.00
Hamburg    Germany     1760433        25859529   755.00
Budapest   Hungary     1754000        27613529   525.20
Warsaw      Poland     1740119        29353648   517.00
Barcelona    Spain     1602386        30956034   101.90
Munich     Germany     1493900        32449934   310.40
Milan        Italy     1350680        33800614   181.80

In [218]:
city_frame.sort_values(by="area", ascending=False)

           country  population  cum_population     area
London     England     8615246         8615246  1572.00
Rome         Italy     2874038        18216685  1285.00
Berlin     Germany     3562166        12177412   891.85
Hamburg    Germany     1760433        25859529   755.00
Madrid       Spain     3165235        15342647   605.77
Budapest   Hungary     1754000        27613529   525.20
Warsaw      Poland     1740119        29353648   517.00
Vienna     Austria     1805681        22295671   414.60
Munich     Germany     1493900        32449934   310.40
Bucharest  Romania     1803425        24099096   228.00
Milan        Italy     1350680        33800614   181.80
Paris       France     2273305        20489990   105.40
Barcelona    Spain     1602386        30956034   101.90

In [230]:
city_frame = pd.DataFrame(cities, columns=["country", "area", "population"], index=cities["name"])
some_areas = pd.Series([1572, 755, 181.8], index=["London", "Hamburg", "Milan"])
city_frame["area"] = some_areas
city_frame

           country    area  population
London     England  1572.0     8615246
Berlin     Germany     NaN     3562166
Madrid       Spain     NaN     3165235
Rome         Italy     NaN     2874038
Paris       France     NaN     2273305
Vienna     Austria     NaN     1805681
Bucharest  Romania     NaN     1803425
Hamburg    Germany   755.0     1760433
Budapest   Hungary     NaN     1754000
Warsaw      Poland     NaN     1740119
Barcelona    Spain     NaN     1602386
Munich     Germany     NaN     1493900
Milan        Italy   181.8     1350680

In [238]:
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population"],
                          index=cities["name"])
city_frame.insert(loc=1, column="area", value=area)
city_frame

           country     area  population
London     England  1572.00     8615246
Berlin     Germany   891.85     3562166
Madrid       Spain   605.77     3165235
Rome         Italy  1285.00     2874038
Paris       France   105.40     2273305
Vienna     Austria   414.60     1805681
Bucharest  Romania   228.00     1803425
Hamburg    Germany   755.00     1760433
Budapest   Hungary   525.20     1754000
Warsaw      Poland   517.00     1740119
Barcelona    Spain   101.90     1602386
Munich     Germany   310.40     1493900
Milan        Italy   181.80     1350680

In [252]:
df = pd.DataFrame(columns=["lib","qty1","qty2"])
for i in range(5):
    df.loc[i] = ["name" + str(i)] + list(np.random.randint(10, size=2))
df

     lib  qty1  qty2
0  name0     0     8
1  name1     2     5
2  name2     7     4
3  name3     1     9
4  name4     3     1

In [254]:
growth = {"Switzerland": {"2010": 3.0, "2011": 1.8, "2012": 1.1, "2013": 1.9},
          "Germany": {"2010": 4.1, "2011": 3.6, "2012":	0.4, "2013": 0.1},
          "France": {"2010":2.0,  "2011":2.1, "2012": 0.3, "2013": 0.3},
          "Greece": {"2010":-5.4, "2011":-8.9, "2012":-6.6, "2013":	-3.3},
          "Italy": {"2010":1.7, "2011":	0.6, "2012":-2.3, "2013":-1.9}
          } 
growth_frame = pd.DataFrame(growth)
growth_frame

      Switzerland  Germany  France  Greece  Italy
2010          3.0      4.1     2.0    -5.4    1.7
2011          1.8      3.6     2.1    -8.9    0.6
2012          1.1      0.4     0.3    -6.6   -2.3
2013          1.9      0.1     0.3    -3.3   -1.9

In [256]:
growth_frame.T

             2010  2011  2012  2013
Switzerland   3.0   1.8   1.1   1.9
Germany       4.1   3.6   0.4   0.1
France        2.0   2.1   0.3   0.3
Greece       -5.4  -8.9  -6.6  -3.3
Italy         1.7   0.6  -2.3  -1.9

In [259]:
growth_frame2 = growth_frame.T.reindex(["Switzerland", "Italy", "Germany", "Greece"])
print(growth_frame2)

             2010  2011  2012  2013
Switzerland   3.0   1.8   1.1   1.9
Italy         1.7   0.6  -2.3  -1.9
Germany       4.1   3.6   0.4   0.1
Greece       -5.4  -8.9  -6.6  -3.3

In [262]:
names = ['Frank', 'Eve', 'Stella', 'Guido', 'Lara']
index = ["January", "February", "March",
         "April", "May", "June",
         "July", "August", "September",
         "October", "November", "December"]
df = pd.DataFrame((np.random.randn(12, 5)*1000).round(2), columns=names, index=index)
df

             Frank      Eve   Stella    Guido     Lara
January     461.95 -1602.65 -1725.05  1209.95 -1387.85
February   -337.76 -1005.38  1072.48  -927.84 -1855.79
March      -796.01   -84.54   336.42  -349.04   112.25
April       899.95   -13.17 -1572.83   414.77  -690.03
May        -865.44  -936.46  -299.09  -659.12 -1377.10
June       -388.14  1851.88 -1135.48  1162.92   754.67
July      -1039.34 -1458.61  -597.58 -1386.61  -415.15
August     1783.55  -416.89   657.77  -389.41 -1803.55
September  -901.34    96.16  -663.16  1650.25  -761.41
October    -741.60   491.00  -763.01   861.85   849.07
November    441.52 -1511.23  -293.81    52.49   -67.88
December   -754.29  1032.75  -463.41  -974.48  1112.80

# Accessing and Changing values of DataFrames

In [263]:
first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist', 
       'data scientist', 'accountant', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Java', 'Cobol', 'Brainfuck')

df = pd.DataFrame(list(zip(last, job, language)), 
                  columns =['last', 'job', 'language'],
                  index=first) 
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete       Meyr          accountant      Cobol
Kate       Mair        psychiatrist  Brainfuck

In [264]:
print(df.loc['Bill', 'job'])
print(df.at['Bill', 'job'])

df.loc['Bill', 'job'] = 'data analyst'
print(df.loc['Bill', 'job'])

df.at['Pete', 'language'] = 'Python'

data scientist
data scientist
data analyst

In [269]:
s = pd.Series([27, 33, 13, 19])
s = s.replace(13, 42)
s

0    27
1    33
2    42
3    19
dtype: int64

In [271]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace([0, 1, 2], 42, inplace=True)
s

0    42
1    42
2    42
3     3
4     4
dtype: int64

In [272]:
import pandas as pd

first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist', 
       'data scientist', 'programmer', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Pithon', 'Pythen', 'Brainfuck')

df = pd.DataFrame(list(zip(last, job, language)), 
                  columns =['last', 'job', 'language'],
                  index=first) 

df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist     Pithon
Pete       Meyr          programmer     Pythen
Kate       Mair        psychiatrist  Brainfuck

In [274]:
df.replace("programmer", "computer scientist", inplace=True)
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier  computer scientist       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist     Pithon
Pete       Meyr  computer scientist     Pythen
Kate       Mair        psychiatrist  Brainfuck

In [275]:
df.replace(to_replace=['Mike', 'Tom', 'Perl'],
           value= ['Michael', 'Thomas', 'Python'], 
           inplace=True)
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier  computer scientist     Python
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist     Pithon
Pete       Meyr  computer scientist     Pythen
Kate       Mair        psychiatrist  Brainfuck

In [276]:
df.replace(to_replace=[r'M[ea][iy]e?r', r'P[iy]th[eo]n'],
           value=['Mayer', 'Python'],
           regex=True, 
           inplace=True)
df

           last                 job   language
Mike      Mayer        data analyst     Python
Dorothee  Mayer  computer scientist     Python
Tom       Mayer  computer scientist       Java
Bill      Mayer      data scientist     Python
Pete      Mayer  computer scientist     Python
Kate      Mayer        psychiatrist  Brainfuck

In [278]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': ['foo', 'bar', 'bloo', 'blee', 'bloo'],
                   'C': ['green', 'red', 'blue', 'yellow', 'green']})

df.replace(to_replace={"A": {0: 42, 3: 33}, 'B': {'bloo': 'vloo'}}, inplace=True)
df

    A     B       C
0  42   foo   green
1   1   bar     red
2   2  vloo    blue
3  33  blee  yellow
4   4  vloo   green

In [296]:
df = pd.DataFrame({
    'name':['Ben', 'Kate', 'Agnes', 'Ashleigh', 'Tom'],
    'job':['programmer', 'NN', 'NN', 'engineer', 'teacher'],
    'language':['Java', 'Python', 'LN', 'LN', 'C']})

df.replace(to_replace='NN', value=None, method='ffill')

/tmp/ipykernel_6218/1663970082.py:6: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(to_replace='NN', value=None, method='ffill')

       name         job language
0       Ben  programmer     Java
1      Kate  programmer   Python
2     Agnes  programmer       LN
3  Ashleigh    engineer       LN
4       Tom     teacher        C

In [297]:
df.replace(to_replace=['NN', 'LN'],
           value=None,
           method='ffill')

/tmp/ipykernel_6218/2302480870.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(to_replace=['NN', 'LN'],

       name         job language
0       Ben  programmer     Java
1      Kate  programmer   Python
2     Agnes  programmer   Python
3  Ashleigh    engineer   Python
4       Tom     teacher        C

In [298]:
df.replace(['NN', 'LN'], value=None, method='bfill')

/tmp/ipykernel_6218/3959233815.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(['NN', 'LN'], value=None, method='bfill')

       name         job language
0       Ben  programmer     Java
1      Kate    engineer   Python
2     Agnes    engineer        C
3  Ashleigh    engineer        C
4       Tom     teacher        C

In [299]:
df.replace('NN', 
           value=None,
           inplace=True,
           method='bfill')
df.replace('LN', 
           value=None,
           inplace=True,
           method='ffill')
df

/tmp/ipykernel_6218/3229978921.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace('NN',
/tmp/ipykernel_6218/3229978921.py:5: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace('LN',

       name         job language
0       Ben  programmer     Java
1      Kate    engineer   Python
2     Agnes    engineer   Python
3  Ashleigh    engineer   Python
4       Tom     teacher        C

In [303]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield'])

df.loc[['viper', 'sidewinder']]
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [304]:
df.loc[lambda df: df['shield'] == 8]

            max_speed  shield
sidewinder          7       8

In [307]:
df.loc[['viper', 'sidewinder'], ['shield']] = 50
df

            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50

In [309]:
df.loc[df['shield'] > 35] = 0
df

            max_speed  shield
cobra               1       2
viper               0       0
sidewinder          0       0